[M_CreatureSlaughter_1 MissionDefinition]
TeaserText="Countless lives, tons of loot. 1 (Maximum of 4) Can the Vault Hunter (and/or his friends) survive? [place]Natural food supplements[-place]?"

[M_CreatureSlaughter_1:SurviveRound MissionObjectiveDefinition]
ProgressMessage="longevity"

[M_CreatureSlaughter_2:SurviveRound MissionObjectiveDefinition]
ProgressMessage="Big day"

[M_CreatureSlaughter_3:SurviveRound MissionObjectiveDefinition]
ProgressMessage="Save it for round 3"

[M_CreatureSlaughter_4:SurviveRound MissionObjectiveDefinition]
ProgressMessage="Surviving the 4th round"

[M_CreatureSlaughter_5:SurviveRound MissionObjectiveDefinition]
ProgressMessage="survive the fifth round"
